<a href="https://colab.research.google.com/github/aadi121/MoM_new/blob/master/Merging.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd 

from pandas import Series, DataFrame

In [0]:
df1 = DataFrame([[1,1,3],[1,2,3]],
                index = ['cat','dog'],
                columns=['key','Value','value1'])
df1

     key  Value  value1
cat    1      1       3
dog    1      2       3

In [0]:
df1.T

       cat dog
key      a   1
Value    b   2
value1   c   3

In [0]:
df1.stack()

cat  key       a
     Value     b
     value1    c
dog  key       1
     Value     2
     value1    3
dtype: object

In [0]:
df1.unstack(0)

key     cat    a
        dog    1
Value   cat    b
        dog    2
value1  cat    c
        dog    3
dtype: object

In [0]:
s1 = Series([0,1,2],index=['a','b','c'])
s2 = Series([4,5,6],index=['c','d','e'])
s3 = pd.concat([s1,s2],keys=['one','two'])
s3

one  a    0
     b    1
     c    2
two  c    4
     d    5
     e    6
dtype: int64

In [0]:
df1

     key  Value  value1
cat    1      1       3
dog    1      2       3

In [0]:
df1.drop_duplicates('Value')

     key  Value  value1
cat    1      1       3
dog    1      2       3

In [0]:
New_Column = {1:'chicken', 2:'pork'}

In [95]:
df1['food'] = df1['Value'].map(New_Column)
df1

     key  Value  value1      abc     food
cat    1      1       3  chicken  chicken
dog    1      2       3     pork     pork

In [107]:
df1['abc'].astype(str)
df1['food'].astype(str)

cat    chicken
dog       pork
Name: food, dtype: object

In [112]:
from google.colab import files

uploaded = files.upload()

Saving android_devices.csv to android_devices.csv
Saving user_device.csv to user_device.csv
Saving user_usage.csv to user_usage.csv

In [161]:
android_device = pd.read_csv(r'android_devices.csv')
user_device = pd.read_csv(r'user_device.csv')
user_usage = pd.read_csv(r'user_usage.csv')
android_device.rename(columns={'Device':'device'},inplace='true')
android_device.head()

  Retail Branding Marketing Name    device                      Model
0             NaN            NaN    AD681H  Smartfren Andromax AD681H
1             NaN            NaN     FJL21                      FJL21
2             NaN            NaN       T31              Panasonic T31
3             NaN            NaN  hws7721g         MediaPad 7 Youth 2
4              3Q        OC1020A   OC1020A                    OC1020A

In [125]:
user_usage.head()

   outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                    21.97                    4.82     1557.33   22787
1                  1710.08                  136.88     7267.55   22788
2                  1710.08                  136.88     7267.55   22789
3                    94.46                   35.17      519.12   22790
4                    71.59                   79.26     1557.33   22792

In [119]:
user_device.head()

   use_id  user_id platform  platform_version     device  use_type_id
0   22782    26980      ios              10.2  iPhone7,2            2
1   22783    29628  android               6.0    Nexus 5            3
2   22784    28473  android               5.1   SM-G903F            1
3   22785    15200      ios              10.2  iPhone7,2            3
4   22786    28239  android               6.0  ONE E1003            1

In [156]:
result = user_usage.merge(user_device,on='use_id',how='left',indicator='True')
result.head()

   outgoing_mins_per_month  outgoing_sms_per_month  ...  use_type_id  True
0                    21.97                    4.82  ...          1.0  both
1                  1710.08                  136.88  ...          1.0  both
2                  1710.08                  136.88  ...          1.0  both
3                    94.46                   35.17  ...          1.0  both
4                    71.59                   79.26  ...          1.0  both

[5 rows x 10 columns]

In [164]:
final = result.merge(android_device,on='device',how='left')
final.

SyntaxError: ignored